# [0, 0, 0, 0], 原地不動
# [0, 0, 0, 1], 原地+右平移
# [0, 0, 0, 2], 原地+左平移
# [0, 0, 1, 0], 原地原地跳
# [0, 0, 1, 1], 原地+右平移
# [0, 0, 1, 2], 原地+左平移
# [0, 1, 0, 0], 原地+右轉
# [0, 1, 0, 1], 原地+右轉+右平移
# [0, 1, 0, 2], 原地+右轉+左平移
# [0, 1, 1, 0], 原地+右轉+跳
# [0, 1, 1, 1], 原地+右轉+跳+右平移
# [0, 1, 1, 2], 原地+右轉+跳+左平移
# [0, 2, 0, 0], 原地+左轉
# [0, 2, 0, 1], 原地+左轉+右平移
# [0, 2, 0, 2], 原地+左轉+左平移
# [0, 2, 1, 0], 原地+左轉+跳
# [0, 2, 1, 1], 原地+左轉+跳+右平移
# [0, 2, 1, 2], 原地+左轉+跳+左平移
# [1, 0, 0, 0], 前進
# [1, 0, 0, 1], 前進+右平移
# [1, 0, 0, 2], 前進+左平移
# [1, 0, 1, 0], 前進+跳
# [1, 0, 1, 1], 前進+跳+右平移
# [1, 0, 1, 2], 前進+跳+左平移
# [1, 1, 0, 0], 前進+右轉
# [1, 1, 0, 1], 前進+右轉+右平移
# [1, 1, 0, 2], 前進+右轉+左平移
# [1, 1, 1, 0], 前進+右轉+跳
# [1, 1, 1, 1], 前進+右轉+跳+右平移
# [1, 1, 1, 2], 前進+右轉+跳+左平移
# [1, 2, 0, 0], 前進+左轉
# [1, 2, 0, 1], 前進+左轉+右平移
# [1, 2, 0, 2], 前進+左轉+左平移
# [1, 2, 1, 0], 前進+左轉+跳
# [1, 2, 1, 1], 前進+左轉+跳+右平移
# [1, 2, 1, 2], 前進+左轉+跳+左平移
# [2, 0, 0, 0], 後退
# [2, 0, 0, 1], 後退+右平移
# [2, 0, 0, 2], 後退+左平移
# [2, 0, 1, 0], 後退+跳
# [2, 0, 1, 1], 後退+跳+右平移
# [2, 0, 1, 2], 後退+跳+左平移
# [2, 1, 0, 0], 後退+右轉
# [2, 1, 0, 1], 後退+右轉+右平移
# [2, 1, 0, 2], 後退+右轉+左平移
# [2, 1, 1, 0], 後退+右轉+跳
# [2, 1, 1, 1], 後退+右轉+跳+右平移
# [2, 1, 1, 2], 後退+右轉+跳+左平移
# [2, 2, 0, 0], 後退+左轉
# [2, 2, 0, 1], 後退+左轉+右平移
# [2, 2, 0, 2], 後退+左轉+左平移
# [2, 2, 1, 0], 後退+左轉+跳
# [2, 2, 1, 1], 後退+左轉+跳+右平移
# [2, 2, 1, 2], 後退+左轉+跳+左平移
#跳占用 10偵 每偵為time 5 => 跳一次要花35遊戲時間
def create_action_table():
    table_action = []
    # 動作0原地右轉
    table_action.append([
        [0, 1, 0, 0]
    ])
    # 動作1原地左轉
    table_action.append([
        [0, 2, 0, 0]
    ])
    # 動作2前進
    table_action.append([
        [1, 0, 0, 0]
    ])
    # 動作3前進右轉
    table_action.append([
        [1, 1, 0, 0]
    ])
    # 動作4前進左轉
    table_action.append([
        [1, 2, 0, 0]
    ])
    # 動作5前進+跳 (大前跳)
    table_action.append([
        [1, 0, 1, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
    ])
    # 動作6前進+右轉+跳 (大前右跳) 右轉弧度約70度
    table_action.append([
        [1, 1, 1, 0],
        [1, 1, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
    ])
    # 動作7前進+左轉+跳 (大前左跳) 左轉弧度約70度
    table_action.append([
        [1, 2, 1, 0],
        [1, 2, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
    ])
    # 動作8前進+右轉+跳 (小前右跳) 右轉弧度約70度
    table_action.append([
        [1, 1, 1, 0],
        [1, 1, 0, 0],
        [1, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
    ])
    # 動作9前進+左轉+跳 (小前左跳) 左轉弧度約70度
    table_action.append([
        [1, 2, 1, 0],
        [1, 2, 0, 0],
        [1, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
    ])
    # 動作10原地
    table_action.append([
        [0, 0, 0, 0]
    ])
    return table_action

def create_rainbow_action_table():
    table_action = [[0, 1, 0, 0],  # 動作0原地右轉
                    [0, 2, 0, 0],  # 動作1原地左轉
                    [1, 0, 0, 0],  # 動作2前進
                    [1, 1, 0, 0],  # 動作3前進右轉
                    [1, 2, 0, 0],  # 動作4前進左轉
                    [1, 0, 1, 0],  # 動作5前跳
                    [0, 0, 0, 1],  # 動作6右平移
                    [0, 0, 0, 2]]  # 動作7左平移
    return table_action

def create_rainbow_old_action_table():
    table_action = []
    # 動作0原地右轉
    table_action.append([
        [0, 1, 0, 0]
    ])
    # 動作1原地左轉
    table_action.append([
        [0, 2, 0, 0]
    ])
    # 動作2前進
    table_action.append([
        [1, 0, 0, 0]
    ])
    # 動作3前進右轉
    table_action.append([
        [1, 1, 0, 0]
    ])
    # 動作4前進左轉
    table_action.append([
        [1, 2, 0, 0]
    ])
    # 動作5前進+跳 (大前跳)
    table_action.append([
        [1, 0, 1, 0]
    ])
    # 動作6前進+右轉+跳 (大前右跳) 右轉弧度約70度
    table_action.append([
        [1, 1, 1, 0],
        [1, 1, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
    ])
    # 動作7前進+左轉+跳 (大前左跳) 左轉弧度約70度
    table_action.append([
        [1, 2, 1, 0],
        [1, 2, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
        [1, 0, 0, 0],
    ])
    # 動作8前進+右轉+跳 (小前右跳) 右轉弧度約70度
    table_action.append([
        [1, 1, 1, 0],
        [1, 1, 0, 0],
        [1, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
    ])
    # 動作9前進+左轉+跳 (小前左跳) 左轉弧度約70度
    table_action.append([
        [1, 2, 1, 0],
        [1, 2, 0, 0],
        [1, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
        [0, 0, 0, 0],
    ])
    # 動作10原地
    table_action.append([
        [0, 0, 0, 0]
    ])
    return table_action


